package com.zdv.shop.common.utils;

import java.io.BufferedReader;
import java.io.InputStream;
import java.io.InputStreamReader;
import java.io.UnsupportedEncodingException;
import java.net.HttpURLConnection;
import java.net.URL;
import java.net.URLConnection;



public class CellServer {
	private static final String[] sms_words ={"李克强","年化收益","习近平","东方闪电","乳房","中国电信","世界末日","公寓","监狱","好声音","装 修","商铺","星光","平方","拘留所","楼宇","代办","人民内情真相","法轮","人民真实报道","人民之声论坛","人权","杀笔","傻逼","煞笔","射精","涉日","神通加持法","时代论坛","时事参考","时事论坛","事实独立","收容所","四川独立","他妈的","台独","台盟","台湾独立","台湾狗","台湾建国运动组织","台湾青年独立联盟","台湾政论区","台湾自由联盟","太子党","套牌","天安门录影带","天安门事件","天安门屠杀","天安门一代","统独","统独论坛","突厥斯坦","屠杀","推翻","吾尔开希","西藏独立","洗脑","下体","小肛","邪恶","新观察论坛","新华举报","新华内情","新华通论坛","新疆独立","新生网","新闻封锁","信用危机","性交","学潮","学联","学运","学自联","央视内部晚会","夜话紫禁城","一中一台","伊斯兰运动","阴道","阴胫","淫秽","淫穴","印尼伊斯兰祈祷团","游行","幼齿","幼女","舆论反制","造反","贼民","镇压","争鸣论坛","正见网","正义党论坛","政变","政治反对派","政治犯","政治风波","支那","指点江山论坛","中国复兴论坛","中国孤儿院","中国社会进步党","中国社会论坛","中国威胁论","中国问题论坛","中国真实内容","中国之春","中国猪","中华人民实话实说","中华人民正邪","中华时事","中华养生益智功","中华真实报道","钟山风雨论坛","猪毛","猪毛1","自已的故事","自由民主论坛","自由运动","走私","屙民","嫖娼","汽油短缺","江泽民","汽油飞涨","罢工","法轮功","胡锦涛","人民真实","独院","别墅","公寓","地产","平方","荡妇","贱B","楼宇","a片","商铺","中国移动通信","中央军委","中共中央","二奶","代办证件","你老母","修炼者","做爱","六和彩","台湾陆委会","善念","国民党","处女膜","妓男女院","彩民","性行为","恶警","抵制日货","拉丹","拉登","杀生","李洪志","李登辉","极品推荐","民进党","江流氓","法轮伦","温家宝","男妓","睾丸","短信中心","砸蛋活动","示威","罪魁","聊天热线","达赖","阴部道","陈水扁","罢课","保钓","暴乱","暴政","北大三角地论坛","北韩","北京当局","北京之春","北美自由论坛","藏独","操你妈逼","赤匪","赤化","传单","春夏自由论坛","打倒","大参考","代办","弹劾","地下教会","地下刊物","电视流氓","钓鱼岛","东北独立","东方红时空","东突","东突厥斯坦","东土耳其斯坦","东西南北论坛","动乱","独裁","独裁政治","独夫","独立台湾会","法伦","法仑","法沦","三陪","色情","法纶","法论","法.轮.功","法十轮十功","法谪","法谪功","法囵","法愣","反封锁技术","反腐败论坛","反革命","反攻","反共","反人类","反日","反社会","分裂","粉饰太平","风雨神州","风雨神州论坛","佛展千手法","肛交","高自联","工自联","功法","功友","共产","共产党","共党","共匪","共狗","共军","狗逼","贯通两极法","国家安全","国家机密","国研新闻邮件","国贼","韩东方","韩联潮","汉奸","黑庄","红灯区","红色恐怖","胡紧掏","胡总书记","护法","花花公子","华通时事论坛","华语世界论坛","华岳时事论坛","回民暴动","悔过书","鸡8","鸡扒","鸡吧","鸡八","鸡巴","鸡鸡","鸡毛信文汇","僵贼民","江core","江ze民","江澤民","江八点","江独裁","江戏子","江则民","江贼民","江猪","江猪媳","江主席","疆独","讲法","教徒","揭批书","靖国神社","九评","老人政治","李宏志","李红痔","联总","联总之声","联总之声传单","连胜德","廉政大论坛","炼功","两岸关系","两岸三地论坛","两个中国","流亡","六合彩","六四","陆委会","抡功","轮大","轮功","轮奸","伦功","麻将机","卖国唐捷","毛厕洞","毛片","法抡","毛贼东","美国参考","美国之音","蒙独","蒙古独立","猛料","密穴","民意论坛","民主墙","民族矛盾","南大自由论坛","闹事","你说我说论坛","泡沫经济","屁眼","青天白日旗","情妇","情趣","热站政论网","人民大众时事参考","没有此城市数据","中国电信","三星装饰","装修","装修","洋房","首付","移民","家教","名校","今日建仓","今天布局","今日布局","黑马","私幕","今天建仓","拉升","获利","年化收益","价格6分到8分","建仓","强力","冲击","涨停","实惠套餐","特招班","乳房","首查","法輪","人民真實報導","人民之聲論壇","人權","殺筆","煞筆","時代論壇","時事參考","時事論壇","事實獨立","四川獨立","他媽的","台獨","臺盟","臺灣獨立","臺灣狗","臺灣青年獨立聯盟","臺灣政論區","臺灣自由聯盟","天安門錄影帶","天安門事件","天安門屠殺","天安門一代","統獨","統獨論壇","屠殺","吾爾開希","西藏獨立","洗腦","下體","邪惡","新觀察論壇","新華舉報","新華內情","新華通論壇","新疆獨立","新生網","新聞封鎖","學潮","學聯","學?學自聯","央視內部晚會","夜話紫禁城","伊斯蘭邉?陰道","陰脛","淫穢","遊行","幼齒","輿論反制","倜?鎮壓","爭鳴論壇","正見網","正義黨論壇","政變","政治反對派","政治風波","指點江山論壇","中國復興論壇","中國孤兒院","中國社會進步黨","中國社會論壇","中國威脅論","中國問題論壇","中國真實內容","中國之春","中國豬","中華人民實話實說","中華人民正邪","中華時事","中華養生益智功","中華真實報導","鐘山風雨論壇","豬毛","豬毛1","自由民主論壇","汽油飛漲","罷工","法輪功","人民真實","蕩婦","中國移動通信","中央軍委","代辦證件","修煉者","做愛","臺灣陸委會","國民黨","處女膜","性行為","惡警","抵制日貨","殺生","李登輝","極品推薦","民進黨","達賴","陰部道","陳水扁","21世紀中國基金會","罷課","保釣","暴亂","北大三角地論壇","北韓","北京當局","北美自由論壇","藏獨","操你媽逼","傳單","春夏自由論壇","大參考","代辦","彈劾","地下教會","釣魚島","東北獨立","東方紅時空","東突","法綸","法論","法十輪十功","法謫","法謫功","法圇","反封鎖技術","反腐敗論壇","反人類","反社會","粉飾太平","風雨神州","風雨神州論壇","高自聯","工自聯","共產","共產黨","共黨","共軍","貫通兩極法","國家安全","國家機密","華通時事論壇","華語世界論壇","華嶽時事論壇","回民暴動","悔過書","雞8","雞扒","雞吧","雞八","雞巴","雞雞","雞毛信文匯","僵倜?江八點","江獨裁","江戲子","江則民","江倜?江豬","江豬媳","疆獨","講法","揭批書","靖國神社","九評","李紅痔","聯總","聯總之聲","聯總之聲傳單","陸委會","掄功","輪大","輪功","輪奸","倫功","麻將機","賣國唐捷","毛廁洞","法掄","毛贃|","美國參考","美國之音","蒙獨","蒙古獨立","民意論壇","民主牆","南大自由論壇","鬧事","你說我說論壇","泡沫經濟","情婦","熱站政論網","人民大眾時事參考","耶穌","聖經","家庭電臺","審判日","薄熙來","耶稣","圣经","基督","家庭电台","审判日","宗共","人民內情真相","薄熙来","信用危機","溫家寶","東突厥斯坦","東土耳其斯坦","東西南北論壇","動亂","獨裁","獨裁政治","獨夫","獨立臺灣會","法倫","法侖","法淪","國研新聞郵件","韓聯潮","漢奸","黑莊","紅燈區","紅色恐怖","胡緊掏","胡總書記","護法","連勝德","廉政大論壇","煉功","兩岸關係","兩岸三地論壇","兩個中國","今日建倉","今天佈局","今日佈局","黑馬","星光大道","21世纪中国基金会","生肖","留学"};
	private static final CellServer instance = new CellServer();

	private CellServer() {
		
	}	
	public static CellServer getInstance()
	{
		return instance;
	}
	public static String smsPlit(String source){
    	String str=source,sc = "",sto = "";
    	for(int i=0;i<sms_words.length;i++){    		
    		sc = sms_words[i];
    		if(str.indexOf(sms_words[i])>0){
    			sto = "";
	    		StringBuilder sb = new StringBuilder(sc);
	    		int len = sb.length();
	    		for(int ii=0;ii<len;ii++){
	    			char ch = sc.charAt(ii);
	    			if(ii==(len-1))
	    				sto +=ch;
	    			else
	    				sto +=ch+"l";
	    		}    		
	    		str = str.replaceAll(sms_words[i],sto);
    		}
    	}
    	return str;	
	}
	
	public static void main(String[] args) {
		// TODO Auto-generated method stub
		CellServer cs = CellServer.getInstance();
		cs.sendMessage("13760351001","收到吗",2);
		/*String message = "易买易送提供(08日12点34分)卤五花肉饭中份1份;隆江猪脚饭中份1份;九零后,单号2098,18938860833送餐地址:深圳留 学生创业大厦1206;交易码876559 回复7:已收到订单；回复8:该菜品已售完，另订";
		message = smsPlit(message);*/
		//System.out.println(cs.sendSmsxin(""));
		//System.out.println(cs.ReceiveMessage("").length());18988776708
	
		//cs.confrim("22811549711");
	}
	
	
	public boolean sendMessage(String tel,String message,int i){
        //生成调用的URL.如果参数中有中文一定要用 java.net.URLEncoder.encode(<参数>,"UTF-8")
		
	  	    String qurl="";	  	    
				try {
					if("".equalsIgnoreCase(message)||message==null)return false;
					message = smsPlit(message);
					qurl = "http://gd.ums86.com:8899/sms/Api/Send.do?SpCode=208433&LoginName=send&Password=hjbpyzn@1937&MessageContent=" + java.net.URLEncoder.encode(message,"GBK")+"&UserNumber="+tel+"&SerialNumber=&ScheduleTime=&ExtendAccessNum=&f=1";
				} catch (UnsupportedEncodingException e1) {
					// TODO Auto-generated catch block
					e1.printStackTrace();
				}
				
				URL url;
	            try {
	                url = new URL(qurl);
	                URLConnection URLconnection = url.openConnection();  
	                HttpURLConnection httpConnection = (HttpURLConnection)URLconnection;  
	                int responseCode = httpConnection.getResponseCode();  
	                if (responseCode == HttpURLConnection.HTTP_OK) {  
	                    InputStream urlStream = httpConnection.getInputStream();  
	                    BufferedReader bufferedReader = new BufferedReader(new InputStreamReader(urlStream,"GBK"));  

	                    String sCurrentLine = "";  
	                    String sTotalString = "";  
	                    while ((sCurrentLine = bufferedReader.readLine()) != null) {  
	                        sTotalString += sCurrentLine;  
	                    }	                 
	             //System.out.println(sTotalString);
	                       //假设该url页面输出为"OK"  
	                   if (sTotalString.indexOf("发送短信成功")>0) {
	                	   return true;
	                   } else {
	                	   return false;
	                    }  
	                }else{
	                    System.err.println("失败");
	                 }
	            } catch (Exception e) {
	                // TODO Auto-generated catch blockeb
	                e.printStackTrace();
	            }  
	            return false;
	}
}
